---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.FieldDomainPointsByParameter
source: html/d9695f17-93f5-4252-106e-26a431b8f14d.htm
---
# FieldDomainPointsByParameter Properties

Specifies whether the .NET object represents a valid Revit entity.